**ML1 LAB01**

21BDA39

Python datatype and data structure

In [2]:
type(9)

int

In [3]:
type(10.8)

float

In [4]:
type("good morning")

str

In [6]:
type(True)

bool

In [7]:
type(10j)

complex

In [8]:
type([10,20,30,40,50])

list

In [9]:
type((40,70,30,80))

tuple

In [10]:
type({1:"hii",2:"hello",3:"gd mrng"})

dict

INDEXING

In [11]:
list = ['hello','hii','good','morning']
list

['hello', 'hii', 'good', 'morning']

In [12]:
list[0]

'hello'

In [13]:
list[3]

'morning'

OPERATOR

In [15]:
list[2]+list[3]    #concatination

'goodmorning'

In [16]:
1+10

11

LOOPS AND ITERATION

In [20]:
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [21]:
for i in list:
    print(i)

hello
hii
good
morning

In [22]:
for i in range(len(list)):
    print(i)

0
1
2
3

IF-ELSE STATEMENT

In [23]:
if "good" in list:
    print("yes")
else:
    print("no")

yes

FUNCTIONS

In [24]:
def sum(a, b):
    return a+b

In [25]:
sum(3,8)

11

PYTHON FOR DATA SCIENCE

In [26]:
import pandas as pd
import numpy as np

In [27]:
randnum = np.random.randint(20, size = 10)

In [28]:
randnum

array([ 4, 11,  5, 19,  2, 15,  7, 10, 16, 19])

In [29]:
randnum_series = pd.Series(randnum)

In [31]:
randnum_series

0     4
1    11
2     5
3    19
4     2
5    15
6     7
7    10
8    16
9    19
dtype: int32

In [32]:
randnum_series.index

RangeIndex(start=0, stop=10, step=1)

In [33]:
randnum_series.values

array([ 4, 11,  5, 19,  2, 15,  7, 10, 16, 19])

In [34]:
randnum_series.value_counts()

19    2
16    1
2     1
4     1
5     1
7     1
10    1
11    1
15    1
dtype: int64

In [35]:
sample_df = pd.DataFrame([randnum,randnum]).T

In [36]:
sample_df

    0   1
0   4   4
1  11  11
2   5   5
3  19  19
4   2   2
5  15  15
6   7   7
7  10  10
8  16  16
9  19  19

In [37]:
sample_df.columns = ["randomnum01", "randomnum02"]

In [38]:
sample_df

   randomnum01  randomnum02
0            4            4
1           11           11
2            5            5
3           19           19
4            2            2
5           15           15
6            7            7
7           10           10
8           16           16
9           19           19

In [39]:
df = pd.read_csv("preowned_cars.csv")

In [40]:
df

,#,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6014,6014,Maruti Swift VDI,Delhi,2014,27365,Diesel,Manual,First,28.4 kmpl,1248 CC,74 bhp,5.0,7.88 Lakh,4.75
6015,6015,Hyundai Xcent 1.1 CRDi S,Jaipur,2015,100000,Diesel,Manual,First,24.4 kmpl,1120 CC,71 bhp,5.0,NaN,4.00
6016,6016,Mahindra Xylo D4 BSIV,Jaipur,2012,55000,Diesel,Manual,Second,14.0 kmpl,2498 CC,112 bhp,8.0,NaN,2.90
6017,6017,Maruti Wagon R VXI,Kolkata,2013,46000,Petrol,Manual,First,18.9 kmpl,998 CC,67.1 bhp,5.0,NaN,2.65
6018,6018,Chevrolet Beat Diesel,Hyderabad,2011,47000,Diesel,Manual,First,25.44 kmpl,936 CC,57.6 bhp,5.0,NaN,2.50

In [43]:
df.head()

,#,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [44]:
df.tail()

,#,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
6014,6014,Maruti Swift VDI,Delhi,2014,27365,Diesel,Manual,First,28.4 kmpl,1248 CC,74 bhp,5.0,7.88 Lakh,4.75
6015,6015,Hyundai Xcent 1.1 CRDi S,Jaipur,2015,100000,Diesel,Manual,First,24.4 kmpl,1120 CC,71 bhp,5.0,NaN,4.00
6016,6016,Mahindra Xylo D4 BSIV,Jaipur,2012,55000,Diesel,Manual,Second,14.0 kmpl,2498 CC,112 bhp,8.0,NaN,2.90
6017,6017,Maruti Wagon R VXI,Kolkata,2013,46000,Petrol,Manual,First,18.9 kmpl,998 CC,67.1 bhp,5.0,NaN,2.65
6018,6018,Chevrolet Beat Diesel,Hyderabad,2011,47000,Diesel,Manual,First,25.44 kmpl,936 CC,57.6 bhp,5.0,NaN,2.50

In [45]:
df.shape

(6019, 14)

In [46]:
df["Location"].value_counts()

Mumbai        790
Hyderabad     742
Kochi         651
Coimbatore    636
Pune          622
Delhi         554
Kolkata       535
Chennai       494
Jaipur        413
Bangalore     358
Ahmedabad     224
Name: Location, dtype: int64

In [47]:
df.describe()

                 #         Year  Kilometers_Driven        Seats        Price
count  6019.000000  6019.000000       6.019000e+03  5977.000000  6019.000000
mean   3009.000000  2013.358199       5.873838e+04     5.278735     9.479468
std    1737.679967     3.269742       9.126884e+04     0.808840    11.187917
min       0.000000  1998.000000       1.710000e+02     0.000000     0.440000
25%    1504.500000  2011.000000       3.400000e+04     5.000000     3.500000
50%    3009.000000  2014.000000       5.300000e+04     5.000000     5.640000
75%    4513.500000  2016.000000       7.300000e+04     5.000000     9.950000
max    6018.000000  2019.000000       6.500000e+06    10.000000   160.000000

In [48]:
df.corr()

                          #      Year  Kilometers_Driven     Seats     Price
#                  1.000000  0.002354          -0.008734 -0.010832 -0.020275
Year               0.002354  1.000000          -0.173048  0.012333  0.305327
Kilometers_Driven -0.008734 -0.173048           1.000000  0.083113 -0.011493
Seats             -0.010832  0.012333           0.083113  1.000000  0.052225
Price             -0.020275  0.305327          -0.011493  0.052225  1.000000